Tekla.Structures.Filtering.BinaryFilterOperatorType
The binary filter operator type defines the operators between two binary filters.

Tekla.Structures.Filtering.BinaryFilterOperatorType.BOOLEAN_OR
The Boolean OR operator.

Tekla.Structures.Filtering.BinaryFilterOperatorType.BOOLEAN_AND
The Boolean AND operator.

Tekla.Structures.Filtering.BinaryFilterOperatorType.EMPTY
The empty operator represents the end of the expression.